<a href="https://colab.research.google.com/github/kumbhat10/Data_Science_in_Python/blob/master/Learning_Pandas/Pandas_Create_Reading_Writing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Getting Started

In [0]:
import pandas as pd

#Creating data

## **Data Frame**

### A data frame is a table it contains an array of individual entries, each of which has a certain value.
### Each entry corresponds to a row(or record) and a column

In [2]:
pd.DataFrame({'Yes':[50,21],'No':[131,2]})

   Yes   No
0   50  131
1   21    2

In [4]:
pd.DataFrame({'Bob':['I liked it.','It was awful.'],'Sue':['Pretty Good','Bland']})

             Bob          Sue
0    I liked it.  Pretty Good
1  It was awful.        Bland

The dictionary-list constructor assigns values to the column labels, but just uses an ascending count from 0 (0, 1, 2, 3, ...) for the row labels. Sometimes this is OK, but oftentimes we will want to assign these labels ourselves.

The list of row labels used in a DataFrame is known as an **Index**.

In [6]:
pd.DataFrame({'Bob':['I liked it.','It was awful.'],'Sue':['Pretty Good','Bland']},index=['Product A','Product B'])

                     Bob          Sue
Product A    I liked it.  Pretty Good
Product B  It was awful.        Bland

## **Series**

### A series by contrast is a sequence of data values. If a data frame is a table, a series is a list. And in fact you can create one with nothing more than a list:

In [7]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
pd.Series(range(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

A series is, in essence, a single column of a DataFrame. So you can assign column values to the Series the same way as before, using and **Index** parameter. However, a Series does not have a column name, it only has one overall name :

In [3]:
pd.Series([30,35,40], index = ['2015 Sales','2016 Sales' ,'2017 Sales'],name = 'Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

The Series and DataFrame are intimately related.

It's helpful to think of a DataFrame as actually being just a bunch of Series 'Glued Together'.

# **Reading Data Files**

## **pd.read_csv()**

In [8]:
Housing_Test = pd.read_csv('/content/sample_data/california_housing_test.csv')
Housing_Test

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

In [9]:
Housing_Test.shape   # (3000, 9)

(3000, 9)

In [14]:
Housing_Test.head(3)   # grab the first 3 rows  - 5 Rows by default

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0

[3 rows x 9 columns]

## **Write to a csv file**

In [0]:
Housing_Test.to_csv('Housing_rewrite.csv')  # there are many other properties linked with it such as what columns to write, header information, chunk size , etc